import React, { useState, useEffect, useRef } from 'react';
import './body.css'

// Адрес бэкенд сервера: 
const backServerPath = 'http://127.0.0.1:8000/';

// ----------------------------------------------------------------------------------------------------------------------------------------------/
// /Возвращаемая функция
function mainWindow() {


    // /-------------------------------------------------------------------------------------------------------
    // /Возвращаемая верстка
    return (
        <div class="authorization" id='div1' key='div1'>
            <p className="auth1">Главная страница</p>
        </div>
    )
    // Возвращаемая верстка/
    // -------------------------------------------------------------------------------------------------------/

}
// Возвращаемая функция/
// ----------------------------------------------------------------------------------------------------------------------------------------------/


export default mainWindow;